/* ----------------------------------------------------------------------------
 *   MobileDevice.h - interface to MobileDevice.framework 
 *   $LastChangedDate: 2007-07-09 18:59:29 -0700 (Mon, 09 Jul 2007) $
 *
 * Copied from http://iphonesvn.halifrag.com/svn/iPhone/
 * With modifications from Allen Porter and Scott Turner
 *
 * ------------------------------------------------------------------------- */

#ifndef MOBILEDEVICE_H
#define MOBILEDEVICE_H

#ifdef __cplusplus
extern "C" {
#endif
	
#if defined(WIN32)
#include <CoreFoundation.h>
	typedef unsigned int mach_error_t;
#elif defined(__APPLE__)
#include <CoreFoundation/CoreFoundation.h>
#include <mach/error.h>
#endif	
	
	/* Error codes */
#define MDERR_APPLE_MOBILE  (err_system(0x3a))
#define MDERR_IPHONE        (err_sub(0))
	
	/* Apple Mobile (AM*) errors */
#define MDERR_OK                ERR_SUCCESS
#define MDERR_SYSCALL           (ERR_MOBILE_DEVICE | 0x01)
#define MDERR_OUT_OF_MEMORY     (ERR_MOBILE_DEVICE | 0x03)
#define MDERR_QUERY_FAILED      (ERR_MOBILE_DEVICE | 0x04) 
#define MDERR_INVALID_ARGUMENT  (ERR_MOBILE_DEVICE | 0x0b)
#define MDERR_DICT_NOT_LOADED   (ERR_MOBILE_DEVICE | 0x25)
	
	/* Apple File Connection (AFC*) errors */
#define MDERR_AFC_OUT_OF_MEMORY 0x03
	
	/* USBMux errors */
//#define MDERR_USBMUX_ARG_NULL   0x16
//#define MDERR_USBMUX_FAILED     0xffffffff
	
	/* Messages passed to device notification callbacks: passed as part of
	 * am_device_notification_callback_info. */
#define ADNCI_MSG_CONNECTED     1
#define ADNCI_MSG_DISCONNECTED  2
#define ADNCI_MSG_UNKNOWN       3
	
#define AMD_IPHONE_PRODUCT_ID   0x1290
//#define AMD_IPHONE_SERIAL       "3391002d9c804d105e2c8c7d94fc35b6f3d214a3"
	
	/* Services, found in /System/Library/Lockdown/Services.plist */
/*
#define AMSVC_AFC                   CFSTR("com.apple.afc")
#define AMSVC_AFC2                  CFSTR("com.apple.afc2")
#define AMSVC_BACKUP                CFSTR("com.apple.mobilebackup")
#define AMSVC_CRASH_REPORT_COPY     CFSTR("com.apple.crashreportcopy")
#define AMSVC_DEBUG_IMAGE_MOUNT     CFSTR("com.apple.mobile.debug_image_mount")
#define AMSVC_NOTIFICATION_PROXY    CFSTR("com.apple.mobile.notification_proxy")
#define AMSVC_PURPLE_TEST           CFSTR("com.apple.purpletestr")
#define AMSVC_SOFTWARE_UPDATE       CFSTR("com.apple.mobile.software_update")
#define AMSVC_SYNC                  CFSTR("com.apple.mobilesync")
#define AMSVC_SCREENSHOT            CFSTR("com.apple.screenshotr")
#define AMSVC_SYSLOG_RELAY          CFSTR("com.apple.syslog_relay")
#define AMSVC_SYSTEM_PROFILER       CFSTR("com.apple.mobile.system_profiler")
#define AMSVC_SPRINGBOARD_SERVICES  CFSTR("com.apple.springboardservices")
*/

#define NUM_APPLE_USB_INTERFACES 6

/*
static APPLE_USB_INTERFACE_TYPE APPLE_USB_INTERFACES[NUM_APPLE_USB_INTERFACES] = {
    { "Recovery Mode v1",   0x1280 },
    { "Recovery Mode v2",   0x1281 },
    { "Recovery Mode v3",   0x1282 },
    { "Recovery Mode v4",   0x1283 },
    { "DFU/WTF v1",         0x1222 },
    { "DFU/WTF v2",         0x1227 }
};
*/

#define AMDeviceInterfaceIsRecovery(productID) \
    ((productID == APPLE_USB_INTERFACES[0].productID) || \
    (productID == APPLE_USB_INTERFACES[1].productID) || \
    (productID == APPLE_USB_INTERFACES[2].productID) || \
    (productID == APPLE_USB_INTERFACES[3].productID))

#define AMDeviceInterfaceIsDFU(productID) \
    ((productID == APPLE_USB_INTERFACES[4].productID) || \
    (productID == APPLE_USB_INTERFACES[5].productID))

enum {
    kAMDeviceNormalMode = 0,
    kAMDeviceRestoreMode = 1,
    kAMDeviceRecoveryMode = 2,
    kAMDeviceDFUMode = 3,
    kAMDeviceNoMode = 4
};
	
	typedef unsigned int afc_error_t;
	typedef unsigned int usbmux_error_t;
	typedef unsigned int service_conn_t;
	
	struct am_recovery_device;
	
	typedef struct am_device_notification_callback_info {
		struct am_device *dev;  /* 0    device */ 
		unsigned int msg;       /* 4    one of ADNCI_MSG_* */
	} __attribute__ ((packed)) am_device_notification_callback_info;
	
	/* The type of the device restore notification callback functions.
	 * TODO: change to correct type. */
	typedef void (*am_restore_device_notification_callback)(struct am_recovery_device *);
	
	/* This is a CoreFoundation object of class AMRecoveryModeDevice. */
	typedef struct am_recovery_device {
		unsigned char unknown0[8];                          /* 0 */
		am_restore_device_notification_callback callback;   /* 8 */
		void *user_info;                                    /* 12 */
		unsigned char unknown1[12];                         /* 16 */
		unsigned int readwrite_pipe;                        /* 28 */
		unsigned char read_pipe;                            /* 32 */
		unsigned char write_ctrl_pipe;                      /* 33 */
		unsigned char read_unknown_pipe;                    /* 34 */
		unsigned char write_file_pipe;                      /* 35 */
		unsigned char write_input_pipe;                     /* 36 */
	} __attribute__ ((packed)) am_recovery_device;
	
	/* A CoreFoundation object of class AMRestoreModeDevice. */
	typedef struct am_restore_device {
		unsigned char unknown[32];
		int port;
	} __attribute__ ((packed)) am_restore_device;
	
	/* The type of the device notification callback function. */
	typedef void(*am_device_notification_callback)(struct am_device_notification_callback_info *, void* arg);
	
	/* The type of the _AMDDeviceAttached function.
	 * TODO: change to correct type. */
	typedef void *amd_device_attached_callback;
	
	typedef struct am_device {
		unsigned char unknown0[16]; /* 0 - zero */
		unsigned int device_id;     /* 16 */
		unsigned int product_id;    /* 20 - set to AMD_IPHONE_PRODUCT_ID */
		char *serial;               /* 24 - set to AMD_IPHONE_SERIAL */
		unsigned int unknown1;      /* 28 */
		unsigned char unknown2[4];  /* 32 */
		unsigned int lockdown_conn; /* 36 */
		unsigned char unknown3[8];  /* 40 */
	} __attribute__ ((packed)) am_device;
	
	typedef struct am_device_notification {
		unsigned int unknown0;                      /* 0 */
		unsigned int unknown1;                      /* 4 */
		unsigned int unknown2;                      /* 8 */
		am_device_notification_callback callback;   /* 12 */ 
		unsigned int unknown3;                      /* 16 */
	} __attribute__ ((packed)) am_device_notification;
	
	typedef struct afc_connection {
		unsigned int handle;            /* 0 */
		unsigned int unknown0;          /* 4 */
		unsigned char unknown1;         /* 8 */
		unsigned char padding[3];       /* 9 */
		unsigned int unknown2;          /* 12 */
		unsigned int unknown3;          /* 16 */
		unsigned int unknown4;          /* 20 */
		unsigned int fs_block_size;     /* 24 */
		unsigned int sock_block_size;   /* 28: always 0x3c */
		unsigned int io_timeout;        /* 32: from AFCConnectionOpen, usu. 0 */
		void *afc_lock;                 /* 36 */
		unsigned int context;           /* 40 */
	} __attribute__ ((packed)) afc_connection;
	
	typedef struct afc_directory {
		unsigned char unknown[0];   /* size unknown */
	} __attribute__ ((packed)) afc_directory;
	
	typedef struct afc_dictionary {
		unsigned char unknown[0];   /* size unknown */
	} __attribute__ ((packed)) afc_dictionary;
	
	typedef unsigned long long afc_file_ref;
	
	typedef struct usbmux_listener_1 {                  /* offset   value in iTunes */
		unsigned int unknown0;                  /* 0        1 */
		unsigned char *unknown1;                /* 4        ptr, maybe device? */
		amd_device_attached_callback callback;  /* 8        _AMDDeviceAttached */
		unsigned int unknown3;                  /* 12 */
		unsigned int unknown4;                  /* 16 */
		unsigned int unknown5;                  /* 20 */
	} __attribute__ ((packed)) usbmux_listener_1;
	
	typedef struct usbmux_listener_2 {
		unsigned char unknown0[4144];
	} __attribute__ ((packed)) usbmux_listener_2;
	
	typedef struct am_bootloader_control_packet {
		unsigned char opcode;       /* 0 */
		unsigned char length;       /* 1 */
		unsigned char magic[2];     /* 2: 0x34, 0x12 */
		unsigned char payload[0];   /* 4 */
	} __attribute__ ((packed)) am_bootloader_control_packet;
	
	/* ----------------------------------------------------------------------------
	 *   Public routines
	 * ------------------------------------------------------------------------- */
	
#if 0
	typedef struct afc_connection {
		unsigned int handle;            /* 0 */
		unsigned int unknown0;          /* 4 */
		unsigned char unknown1;         /* 8 */
		unsigned char padding[3];       /* 9 */
		unsigned int unknown2;          /* 12 */
		unsigned int unknown3;          /* 16 */
		unsigned int unknown4;          /* 20 */
		unsigned int fs_block_size;     /* 24 */
		unsigned int sock_block_size;   /* 28: always 0x3c */
		unsigned int io_timeout;        /* 32: from AFCConnectionOpen, usu. 0 */
		void *afc_lock;                 /* 36 */
		unsigned int context;           /* 40 */
	} __attribute__ ((packed)) afc_connection;
#endif
	//typedef struct _afc_connection			*afc_connection;
	
#if 0
	typedef struct afc_directory {
		unsigned char unknown[0];   /* size unknown */
	} __attribute__ ((packed)) afc_directory;
#endif
	//typedef struct _afc_directory			*afc_directory;
	
#if 0
	typedef struct afc_dictionary {
		unsigned char unknown[0];   /* size unknown */
	} __attribute__ ((packed)) afc_dictionary;
#endif
	//typedef struct _afc_dictionary *afc_dictionary;
	
#if 0
	typedef struct usbmux_listener_1 {                  /* offset   value in iTunes */
		unsigned int unknown0;                  /* 0        1 */
		unsigned char *unknown1;                /* 4        ptr, maybe device? */
		amd_device_attached_callback callback;  /* 8        _AMDDeviceAttached */
		unsigned int unknown3;                  /* 12 */
		unsigned int unknown4;                  /* 16 */
		unsigned int unknown5;                  /* 20 */
	} __attribute__ ((packed)) usbmux_listener_1;
	
	typedef struct usbmux_listener_2 {
		unsigned char unknown0[4144];
	} __attribute__ ((packed)) usbmux_listener_2;
	
	typedef struct am_bootloader_control_packet {
		unsigned char opcode;       /* 0 */
		unsigned char length;       /* 1 */
		unsigned char magic[2];     /* 2: 0x34, 0x12 */
		unsigned char payload[0];   /* 4 */
	} __attribute__ ((packed)) am_bootloader_control_packet;
#endif
	
	typedef int muxconn_t;
	typedef int am_service;
	typedef struct _afc_operation *afc_operation;
	
#if 0
	// AFC connection functions
	//afc_error_t AFCConnectionOpen(am_service handle,uint32_t io_timeout,afc_connection *conn);
	//afc_error_t AFCConnectionClose(afc_connection conn);
	// int _AFCConnectionIsValid(afc_connection *conn)
	uint32_t AFCConnectionGetContext(afc_connection conn);
	uint32_t AFCConnectionSetContext(afc_connection conn, uint32_t ctx);
